-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: localhost    Database: recipe_db
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cuisine`
--

DROP TABLE IF EXISTS `cuisine`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cuisine` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cuisine`
--

LOCK TABLES `cuisine` WRITE;
/*!40000 ALTER TABLE `cuisine` DISABLE KEYS */;
INSERT INTO `cuisine` VALUES (9,'东北菜'),(15,'东南亚菜'),(11,'云南菜'),(16,'其他'),(1,'川菜'),(8,'徽菜'),(12,'日料'),(6,'浙菜'),(3,'湘菜'),(2,'粤菜'),(5,'苏菜'),(10,'西北菜'),(14,'西餐'),(7,'闽菜'),(13,'韩餐'),(4,'鲁菜');
/*!40000 ALTER TABLE `cuisine` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `difficulty`
--

DROP TABLE IF EXISTS `difficulty`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `difficulty` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `level` varchar(20) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `level` (`level`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `difficulty`
--

LOCK TABLES `difficulty` WRITE;
/*!40000 ALTER TABLE `difficulty` DISABLE KEYS */;
INSERT INTO `difficulty` VALUES (2,'中等'),(3,'困难'),(1,'简单');
/*!40000 ALTER TABLE `difficulty` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `favorites`
--

DROP TABLE IF EXISTS `favorites`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `favorites` (
  `user_id` int unsigned NOT NULL,
  `recipe_id` int unsigned NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`,`recipe_id`),
  KEY `recipe_id` (`recipe_id`),
  KEY `idx_user_favorites` (`user_id`),
  CONSTRAINT `favorites_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  CONSTRAINT `favorites_ibfk_2` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `favorites`
--

LOCK TABLES `favorites` WRITE;
/*!40000 ALTER TABLE `favorites` DISABLE KEYS */;
INSERT INTO `favorites` VALUES (1,5,'2026-04-23 23:35:27'),(1,13,'2026-04-22 23:35:27'),(1,75,'2026-04-23 23:35:27'),(1,78,'2026-04-21 23:35:27'),(1,82,'2026-04-24 23:35:27'),(2,1,'2026-04-28 20:46:06'),(2,6,'2026-04-29 07:54:55');
/*!40000 ALTER TABLE `favorites` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `history`
--

DROP TABLE IF EXISTS `history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `history` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int unsigned NOT NULL,
  `recipe_id` int unsigned NOT NULL,
  `viewed_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq_user_recipe` (`user_id`,`recipe_id`),
  KEY `recipe_id` (`recipe_id`),
  KEY `idx_user_history` (`user_id`),
  CONSTRAINT `history_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  CONSTRAINT `history_ibfk_2` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=73 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `history`
--

LOCK TABLES `history` WRITE;
/*!40000 ALTER TABLE `history` DISABLE KEYS */;
INSERT INTO `history` VALUES (1,2,1,'2026-04-28 21:07:06'),(2,2,2,'2026-04-28 23:03:13'),(5,2,5,'2026-04-28 22:57:59'),(6,2,6,'2026-04-29 07:54:52'),(7,1,36,'2026-04-28 17:49:27'),(8,1,5,'2026-04-28 14:51:06'),(9,1,43,'2026-04-28 17:34:25'),(10,1,26,'2026-04-28 20:09:25'),(11,1,67,'2026-04-28 20:47:16'),(12,1,31,'2026-04-28 15:19:23'),(13,1,78,'2026-04-28 23:34:41'),(14,1,74,'2026-04-28 13:26:56'),(15,1,21,'2026-04-28 09:32:37'),(16,1,62,'2026-04-28 21:59:17'),(17,1,24,'2026-04-28 12:07:36'),(18,1,33,'2026-04-27 09:31:31'),(20,1,27,'2026-04-27 17:33:44'),(21,1,12,'2026-04-26 08:44:44'),(22,1,59,'2026-04-26 15:30:25'),(23,1,55,'2026-04-26 13:12:13'),(24,1,51,'2026-04-26 15:09:21'),(25,1,81,'2026-04-26 11:01:38'),(26,1,76,'2026-04-26 10:57:54'),(27,1,47,'2026-04-26 22:34:17'),(28,1,2,'2026-04-25 23:07:08'),(29,1,25,'2026-04-25 08:45:16'),(30,1,85,'2026-04-25 22:17:51'),(32,1,71,'2026-04-25 22:43:52'),(33,1,84,'2026-04-25 11:58:08'),(34,1,42,'2026-04-25 23:16:07'),(35,1,86,'2026-04-25 10:15:15'),(36,1,17,'2026-04-25 22:08:54'),(38,1,63,'2026-04-25 15:22:09'),(39,1,66,'2026-04-25 17:16:52'),(40,1,22,'2026-04-24 23:28:02'),(41,1,45,'2026-04-24 11:49:49'),(42,1,16,'2026-04-24 23:55:18'),(43,1,29,'2026-04-24 14:49:55'),(47,1,35,'2026-04-24 17:27:10'),(48,1,68,'2026-04-24 15:47:24'),(49,1,6,'2026-04-24 16:09:44'),(50,1,65,'2026-04-24 10:40:57'),(51,1,69,'2026-04-23 13:24:05'),(53,1,72,'2026-04-23 14:04:32'),(54,1,75,'2026-04-23 22:02:22'),(60,1,13,'2026-04-23 23:27:26'),(61,1,11,'2026-04-22 12:25:47'),(66,1,18,'2026-04-22 13:56:46'),(67,1,41,'2026-04-22 19:32:19'),(68,1,49,'2026-04-22 10:15:52'),(70,1,56,'2026-04-22 10:40:42');
/*!40000 ALTER TABLE `history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ingredients`
--

DROP TABLE IF EXISTS `ingredients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ingredients` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=222 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ingredients`
--

LOCK TABLES `ingredients` WRITE;
/*!40000 ALTER TABLE `ingredients` DISABLE KEYS */;
INSERT INTO `ingredients` VALUES (151,'三文鱼中段'),(213,'仁当咖喱酱'),(16,'八角'),(98,'冬笋'),(13,'冰糖'),(57,'剁辣椒'),(42,'午餐肉'),(215,'南姜'),(159,'去骨鸡腿肉'),(205,'叻沙酱'),(160,'味醂'),(49,'咸蛋黄'),(61,'土豆'),(171,'土豆淀粉'),(111,'土鸡'),(43,'基围虾'),(74,'大对虾'),(75,'大葱'),(70,'大葱白'),(31,'大蒜'),(207,'大虾'),(219,'大闸蟹蟹粉'),(14,'姜'),(47,'娃娃菜'),(27,'嫩豆腐'),(134,'孜然粒'),(220,'小油菜'),(145,'小米辣'),(139,'小茴香'),(33,'小葱'),(119,'小青菜'),(187,'帕玛森奶酪'),(196,'干白葡萄酒'),(142,'干米线'),(20,'干辣椒'),(118,'干香菇'),(183,'意大利面'),(10,'排骨'),(15,'料酒'),(197,'新鲜欧芹'),(186,'新鲜罗勒叶'),(195,'新鲜贻贝'),(221,'春笋'),(175,'春酱'),(218,'木耳'),(91,'松子仁'),(146,'柠檬'),(154,'柴鱼高汤'),(150,'树番茄'),(77,'桂皮'),(102,'植物油'),(199,'椰奶'),(202,'椰糖'),(185,'橄榄油'),(96,'母鸡'),(41,'毛肚'),(121,'毛豆腐'),(17,'水'),(112,'水发干笋'),(69,'水发海参'),(148,'水性杨花（海菜花茎）'),(34,'水淀粉'),(51,'河粉'),(86,'河虾仁'),(114,'油豆腐'),(201,'泰国罗勒叶'),(135,'洋葱'),(158,'海带芽'),(152,'海盐'),(178,'海苔碎'),(108,'海螺'),(23,'淀粉'),(153,'清酒'),(97,'火腿'),(9,'焦糖'),(163,'熟白芝麻'),(191,'熟透番茄'),(52,'牛肉'),(2,'牛肉馅'),(179,'牛肩肉'),(137,'牛腩'),(81,'牛腱子肉'),(189,'牛至叶'),(35,'牛里脊肉'),(62,'猪五花肉'),(58,'猪大肠'),(120,'猪油'),(28,'猪肉末'),(106,'猪肋排'),(105,'猪肝'),(125,'猪脊骨'),(101,'猪里脊肉'),(32,'生姜'),(11,'生抽'),(5,'番茄'),(184,'番茄罐头'),(76,'番茄酱'),(157,'白味噌'),(71,'白糖'),(25,'白胡椒粉'),(83,'白菜叶'),(60,'白醋'),(181,'百里香'),(48,'皮蛋'),(24,'盐'),(87,'碧螺春茶叶'),(107,'福建老酒'),(203,'米粉'),(161,'米饭'),(115,'粉丝'),(164,'糖'),(211,'糯米'),(64,'红尖椒'),(88,'红曲米'),(132,'红椒'),(192,'红甜椒'),(109,'红糟'),(180,'红葡萄酒'),(117,'红薯粉丝'),(95,'绍兴黄酒'),(138,'羊排'),(141,'羊肉'),(133,'羊腿肉'),(12,'老抽'),(55,'老鸭'),(56,'胖头鱼头'),(79,'胡椒粉'),(172,'胡萝卜'),(66,'腊肉'),(67,'腊肠'),(68,'腊鱼'),(212,'芒果'),(177,'芝麻油'),(4,'花椒'),(30,'花椒粉'),(44,'花生油'),(144,'花生碎'),(200,'茄子'),(136,'草果'),(18,'草鱼'),(217,'荷兰豆'),(104,'荸荠'),(216,'莲藕'),(37,'莴笋叶'),(124,'菜籽油'),(162,'菠菜'),(209,'菠萝'),(7,'葱'),(39,'葱段'),(123,'葱花'),(21,'蒜'),(170,'蒜末'),(46,'蒸鱼豉油'),(204,'虾'),(155,'虾仁'),(131,'蚝油'),(82,'蟹粉'),(156,'蟹肉棒'),(3,'豆瓣酱'),(1,'豆腐'),(100,'豆腐皮'),(53,'豆芽'),(65,'豆豉'),(210,'辣椒'),(127,'辣椒油'),(167,'辣椒粉'),(122,'辣椒酱'),(29,'郫县豆瓣酱'),(92,'酱油'),(149,'酸笋'),(143,'酸腌菜'),(19,'酸菜'),(78,'醋'),(176,'隔夜米饭'),(193,'雪莉酒醋'),(198,'青咖喱酱'),(63,'青尖椒'),(206,'青柠'),(208,'青柠汁'),(110,'青椒'),(59,'青蒜'),(194,'面包'),(140,'面粉'),(165,'韩式年糕'),(169,'韩式泡菜'),(174,'韩式炸酱面面条'),(166,'韩式辣酱'),(54,'韭黄'),(26,'食用油'),(73,'食盐'),(90,'香干'),(214,'香茅'),(99,'香菇'),(128,'香菜'),(85,'香醋'),(89,'马兰头'),(50,'高汤'),(147,'鱼露'),(168,'鱼饼'),(45,'鲈鱼'),(103,'鲍鱼'),(93,'鲜虾仁'),(80,'鲤鱼'),(129,'鳕鱼'),(84,'鳜鱼'),(72,'鸡汤'),(188,'鸡腿'),(38,'鸡腿肉'),(6,'鸡蛋'),(22,'鸡蛋清'),(40,'鸭血'),(113,'鹌鹑蛋'),(182,'黄油'),(173,'黄瓜'),(36,'黄豆芽'),(126,'黄豆酱'),(116,'黄酒'),(190,'黑胡椒'),(94,'龙井茶叶'),(130,'龙口粉丝');
/*!40000 ALTER TABLE `ingredients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recipe_ingredients`
--

DROP TABLE IF EXISTS `recipe_ingredients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipe_ingredients` (
  `recipe_id` int unsigned NOT NULL,
  `ingredient_id` int unsigned NOT NULL,
  `quantity` decimal(6,2) DEFAULT NULL COMMENT '用量数值',
  `unit` varchar(20) DEFAULT NULL COMMENT '单位，如“克”“勺”',
  `notes` varchar(255) DEFAULT NULL COMMENT '备注，如“一定不能选内酯豆腐”',
  PRIMARY KEY (`recipe_id`,`ingredient_id`),
  KEY `idx_recipe` (`recipe_id`),
  KEY `idx_ingredient` (`ingredient_id`),
  CONSTRAINT `recipe_ingredients_ibfk_1` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE,
  CONSTRAINT `recipe_ingredients_ibfk_2` FOREIGN KEY (`ingredient_id`) REFERENCES `ingredients` (`id`) ON DELETE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipe_ingredients`
--

LOCK TABLES `recipe_ingredients` WRITE;
/*!40000 ALTER TABLE `recipe_ingredients` DISABLE KEYS */;
INSERT INTO `recipe_ingredients` VALUES (1,1,400.00,'克','老豆腐'),(1,2,100.00,'克',NULL),(1,3,2.00,'勺',NULL),(1,4,5.00,'克',NULL),(2,5,2.00,'个',NULL),(2,6,3.00,'个',NULL),(2,7,1.00,'根','切葱花'),(5,7,2.00,'根','切段'),(5,10,500.00,'克','斩成小段'),(5,11,30.00,'毫升','用于调味'),(5,12,15.00,'毫升','用于上色'),(5,13,20.00,'克','炒糖色用'),(5,14,3.00,'片',NULL),(5,15,20.00,'毫升','去腥'),(5,16,2.00,'颗',NULL),(5,17,500.00,'毫升','炖煮用'),(6,4,1.00,'汤匙','约10克'),(6,7,2.00,'根','切段'),(6,14,1.00,'块','切片'),(6,15,2.00,'汤匙','约30毫升'),(6,18,1.00,'条（约1000克）','可选用黑鱼或鲈鱼替代'),(6,19,300.00,'克','四川泡酸菜为佳'),(6,20,10.00,'个','根据口味调整'),(6,21,5.00,'瓣','切片'),(6,22,1.00,'个','用于腌鱼'),(6,23,2.00,'汤匙','约20克'),(6,24,1.00,'茶匙','约5克'),(6,25,0.50,'茶匙','约2克'),(6,26,50.00,'毫升','用于炒料和泼油'),(7,26,30.00,'毫升',NULL),(7,27,400.00,'克',NULL),(7,28,100.00,'克',NULL),(7,29,30.00,'克',NULL),(7,30,3.00,'克',NULL),(7,31,3.00,'瓣','切末'),(7,32,10.00,'克','切末'),(7,33,2.00,'根','切葱花'),(7,34,30.00,'毫升','玉米淀粉与水1:2调匀'),(8,4,5.00,'克',NULL),(8,20,15.00,'克','剪段'),(8,22,1.00,'个',NULL),(8,23,15.00,'克',NULL),(8,26,60.00,'毫升',NULL),(8,29,40.00,'克',NULL),(8,31,5.00,'瓣','切末'),(8,32,15.00,'克','切片'),(8,35,300.00,'克','逆纹切薄片'),(8,36,200.00,'克',NULL),(8,37,150.00,'克',NULL),(9,4,10.00,'克',NULL),(9,11,15.00,'毫升',NULL),(9,15,20.00,'毫升',NULL),(9,20,80.00,'克','剪段去籽'),(9,23,30.00,'克',NULL),(9,26,500.00,'毫升','炸用，实际消耗约100毫升'),(9,31,6.00,'瓣','拍碎'),(9,32,15.00,'克','切片'),(9,38,500.00,'克','去骨切2厘米小块'),(9,39,30.00,'克',NULL),(10,4,8.00,'克',NULL),(10,18,1.00,'条','约800克，切片'),(10,20,20.00,'克','剪段'),(10,22,1.00,'个',NULL),(10,23,20.00,'克',NULL),(10,26,80.00,'毫升',NULL),(10,29,50.00,'克',NULL),(10,31,6.00,'瓣','切末'),(10,32,20.00,'克','切片'),(10,36,200.00,'克',NULL),(11,4,8.00,'克',NULL),(11,20,20.00,'克','剪段'),(11,26,60.00,'毫升',NULL),(11,29,50.00,'克',NULL),(11,31,5.00,'瓣','切末'),(11,32,15.00,'克','切片'),(11,36,200.00,'克',NULL),(11,40,300.00,'克','切厚片'),(11,41,200.00,'克','切丝'),(11,42,150.00,'克','切片'),(12,7,2.00,'根','切段'),(12,11,2.00,'汤匙','蘸料用'),(12,14,1.00,'块','切片'),(12,15,1.00,'汤匙',NULL),(12,43,300.00,'克','鲜活'),(12,44,1.00,'汤匙','蘸料用'),(13,7,3.00,'根','切丝'),(13,14,1.00,'块','切丝'),(13,44,2.00,'汤匙','热油淋鱼用'),(13,45,1.00,'条','约500克，处理干净'),(13,46,2.00,'汤匙',NULL),(14,21,3.00,'瓣','切片'),(14,47,2.00,'棵','对半切开'),(14,48,1.00,'个','切丁'),(14,49,2.00,'个','碾碎'),(14,50,300.00,'毫升','清鸡汤或素高汤'),(15,7,2.00,'根','切段'),(15,11,2.00,'汤匙',NULL),(15,12,1.00,'汤匙','上色'),(15,44,3.00,'汤匙',NULL),(15,51,300.00,'克','新鲜宽河粉'),(15,52,150.00,'克','切薄片，用生抽、淀粉腌制'),(15,53,100.00,'克','摘去头尾'),(15,54,50.00,'克','切段'),(17,15,15.00,'毫升',NULL),(17,26,30.00,'毫升',NULL),(17,31,5.00,'瓣','切末'),(17,32,20.00,'克','切片'),(17,33,3.00,'根','切葱花'),(17,46,15.00,'毫升',NULL),(17,56,1.00,'个','约1000克'),(17,57,100.00,'克','红剁椒'),(18,15,30.00,'毫升',NULL),(18,19,150.00,'克','切段'),(18,20,10.00,'个','切段'),(18,24,5.00,'克',NULL),(18,26,30.00,'毫升',NULL),(18,31,5.00,'瓣','拍碎'),(18,32,15.00,'克','切片'),(18,58,500.00,'克','处理干净'),(18,59,3.00,'根','切段'),(18,60,15.00,'毫升',NULL),(19,20,6.00,'个','切段'),(19,24,3.00,'克',NULL),(19,26,20.00,'毫升',NULL),(19,31,3.00,'瓣','切片'),(19,60,20.00,'毫升',NULL),(19,61,2.00,'个','约400克，切细丝'),(20,11,15.00,'毫升',NULL),(20,15,10.00,'毫升',NULL),(20,26,15.00,'毫升',NULL),(20,31,4.00,'瓣','切片'),(20,62,300.00,'克','切薄片'),(20,63,4.00,'个','切圈'),(20,64,2.00,'个','切圈'),(20,65,10.00,'克',NULL),(21,15,15.00,'毫升',NULL),(21,20,3.00,'个','切段（可选）'),(21,32,10.00,'克','切丝'),(21,66,200.00,'克','切薄片'),(21,67,2.00,'根','切片'),(21,68,150.00,'克','切块'),(22,11,15.00,'毫升',NULL),(22,12,10.00,'毫升','用于上色'),(22,15,20.00,'毫升',NULL),(22,32,20.00,'克','切片'),(22,34,30.00,'毫升','勾芡用'),(22,69,500.00,'克','选用肉质厚的'),(22,70,150.00,'克','切段'),(22,71,10.00,'克',NULL),(22,72,300.00,'毫升',NULL),(22,73,3.00,'克',NULL),(23,15,20.00,'毫升',NULL),(23,32,15.00,'克','切片'),(23,44,50.00,'毫升',NULL),(23,71,15.00,'克',NULL),(23,73,3.00,'克',NULL),(23,74,500.00,'克','剪去虾须虾枪'),(23,75,30.00,'克','切段'),(23,76,20.00,'克',NULL),(24,11,20.00,'毫升',NULL),(24,12,15.00,'毫升',NULL),(24,15,30.00,'毫升',NULL),(24,16,3.00,'个',NULL),(24,32,20.00,'克','切片'),(24,58,1000.00,'克','清洗干净'),(24,71,30.00,'克',NULL),(24,73,5.00,'克',NULL),(24,75,50.00,'克','切段'),(24,77,5.00,'克',NULL),(24,78,20.00,'毫升',NULL),(24,79,2.00,'克',NULL),(25,11,15.00,'毫升',NULL),(25,15,15.00,'毫升',NULL),(25,23,50.00,'克','裹鱼用'),(25,31,10.00,'克','切末'),(25,32,10.00,'克','切末'),(25,44,500.00,'毫升','实际消耗约80毫升'),(25,71,30.00,'克',NULL),(25,73,3.00,'克',NULL),(25,75,20.00,'克','切丝'),(25,76,20.00,'克',NULL),(25,78,25.00,'毫升',NULL),(25,80,1.00,'条','约750克，处理干净'),(26,11,20.00,'毫升',NULL),(26,12,10.00,'毫升',NULL),(26,15,20.00,'毫升',NULL),(26,16,2.00,'个',NULL),(26,32,15.00,'克','切片'),(26,34,20.00,'毫升','勾芡用'),(26,71,10.00,'克',NULL),(26,73,4.00,'克',NULL),(26,75,30.00,'克','切段'),(26,77,5.00,'克',NULL),(26,81,500.00,'克',NULL),(27,7,10.00,'克','切段'),(27,14,10.00,'克','切片'),(27,15,15.00,'毫升',NULL),(27,24,5.00,'克',NULL),(27,25,2.00,'克',NULL),(27,62,500.00,'克','肥三瘦七'),(27,82,100.00,'克','新鲜拆制'),(27,83,5.00,'片','覆盖用'),(28,7,5.00,'克','切丝'),(28,14,5.00,'克','切丝'),(28,15,10.00,'毫升',NULL),(28,23,50.00,'克','用于裹鱼'),(28,24,3.00,'克',NULL),(28,26,500.00,'毫升','实际消耗约50毫升'),(28,71,30.00,'克',NULL),(28,76,50.00,'克',NULL),(28,84,1.00,'条','约750克'),(28,85,20.00,'毫升',NULL),(29,15,5.00,'毫升',NULL),(29,22,1.00,'个',NULL),(29,23,10.00,'克',NULL),(29,24,3.00,'克',NULL),(29,26,30.00,'毫升',NULL),(29,86,300.00,'克','新鲜剥壳'),(29,87,5.00,'克','优质'),(30,7,10.00,'克','切段'),(30,14,10.00,'克','切片'),(30,15,15.00,'毫升',NULL),(30,24,3.00,'克',NULL),(30,26,20.00,'毫升',NULL),(30,62,400.00,'克','带皮'),(30,71,25.00,'克',NULL),(30,76,30.00,'克',NULL),(30,88,10.00,'克','调色用'),(31,24,3.00,'克',NULL),(31,26,15.00,'毫升',NULL),(31,71,2.00,'克',NULL),(31,89,300.00,'克','嫩苗'),(31,90,2.00,'块','切丁'),(31,91,20.00,'克','可选'),(32,14,20.00,'克','切末'),(32,15,10.00,'毫升',NULL),(32,18,1.00,'条','约750克'),(32,34,30.00,'毫升',NULL),(32,71,25.00,'克',NULL),(32,78,30.00,'毫升','浙江老醋'),(32,92,15.00,'毫升',NULL),(33,15,5.00,'毫升',NULL),(33,22,1.00,'个',NULL),(33,23,10.00,'克',NULL),(33,24,2.00,'克',NULL),(33,93,200.00,'克','去壳去虾线'),(33,94,5.00,'克','明前龙井'),(34,7,30.00,'克','切段'),(34,13,30.00,'克',NULL),(34,14,20.00,'克','切片'),(34,62,500.00,'克','带皮，切成方块'),(34,92,50.00,'毫升','老抽和生抽各半'),(34,95,100.00,'毫升',NULL),(35,14,10.00,'克','切片'),(35,15,15.00,'毫升',NULL),(35,24,5.00,'克',NULL),(35,96,1.00,'只','约1000克，宰杀洗净'),(35,97,50.00,'克','切片'),(35,98,100.00,'克','切片'),(35,99,30.00,'克','泡发切片'),(36,6,1.00,'个',NULL),(36,15,5.00,'毫升',NULL),(36,24,2.00,'克',NULL),(36,100,200.00,'克','薄豆腐皮'),(36,101,100.00,'克','剁成细末'),(36,102,500.00,'毫升','实际耗油约30毫升'),(38,23,30.00,'克','用于腌制和勾芡'),(38,60,15.00,'毫升',NULL),(38,71,20.00,'克',NULL),(38,76,30.00,'克',NULL),(38,92,10.00,'毫升','生抽'),(38,101,300.00,'克','切厚片剞十字花刀'),(38,104,100.00,'克','切片'),(39,105,300.00,'克','切薄片'),(40,71,15.00,'克',NULL),(40,92,20.00,'毫升','生抽'),(40,106,500.00,'克','斩成小段'),(40,107,50.00,'毫升','或绍兴黄酒'),(41,98,100.00,'克','切片'),(41,108,400.00,'克','取肉切片'),(41,109,30.00,'克','福建红曲酒糟'),(42,7,3.00,'根','打结'),(42,11,1.00,'汤匙',NULL),(42,12,2.00,'汤匙',NULL),(42,13,30.00,'克',NULL),(42,14,1.00,'块','切片'),(42,62,500.00,'克','切块焯水'),(42,111,1.00,'只','切块'),(42,112,200.00,'克','切段'),(42,113,20.00,'个','煮熟去壳'),(43,62,300.00,'克','切厚片'),(43,71,1.00,'汤匙',NULL),(43,92,3.00,'汤匙',NULL),(43,98,200.00,'克','切片'),(43,99,10.00,'朵','泡发'),(43,114,200.00,'克','对半切开'),(43,115,100.00,'克','泡软'),(43,116,2.00,'汤匙',NULL),(44,11,2.00,'汤匙',NULL),(44,12,1.00,'汤匙',NULL),(44,101,100.00,'克','切丝'),(44,117,200.00,'克','泡软剪短'),(44,118,5.00,'朵','泡发切丝'),(44,119,100.00,'克','切段'),(44,120,30.00,'克',NULL),(45,21,5.00,'瓣','切末'),(45,92,1.00,'汤匙',NULL),(45,121,300.00,'克','切厚片'),(45,122,2.00,'汤匙',NULL),(45,123,10.00,'克','装饰用'),(45,124,30.00,'毫升',NULL),(46,11,3.00,'汤匙',NULL),(46,12,2.00,'汤匙',NULL),(46,13,40.00,'克',NULL),(46,14,1.00,'块','切片'),(46,16,2.00,'个',NULL),(46,77,1.00,'小段',NULL),(46,106,500.00,'克','斩段'),(46,116,2.00,'汤匙',NULL),(47,11,2.00,'汤匙',NULL),(47,12,1.00,'汤匙','上色用'),(47,15,2.00,'汤匙',NULL),(47,31,1.00,'整头','剁成蒜末'),(47,32,1.00,'块','切片'),(47,71,1.00,'汤匙',NULL),(47,75,2.00,'根','切段'),(47,125,1000.00,'克','剁成大块'),(47,126,3.00,'汤匙',NULL),(48,11,3.00,'汤匙',NULL),(48,31,1.00,'整头','捣成蒜泥'),(48,62,500.00,'克','选用带皮五花肉'),(48,71,1.00,'茶匙',NULL),(48,85,1.00,'汤匙',NULL),(48,127,1.00,'汤匙','可选'),(49,11,2.00,'汤匙',NULL),(49,12,1.00,'汤匙',NULL),(49,15,2.00,'汤匙',NULL),(49,31,1.00,'整头','去皮拍碎'),(49,32,1.00,'块','切片'),(49,71,1.00,'茶匙',NULL),(49,75,1.00,'根','切段'),(49,129,500.00,'克','切块'),(50,11,2.00,'汤匙',NULL),(50,26,2.00,'汤匙',NULL),(50,31,1.00,'整头','剁成蒜蓉'),(50,47,2.00,'棵','纵向切开'),(50,130,1.00,'把','温水泡软'),(50,131,1.00,'汤匙',NULL),(50,132,1.00,'个','切圈装饰'),(51,11,2.00,'汤匙',NULL),(51,15,2.00,'汤匙',NULL),(51,31,1.00,'整头','切末'),(51,133,500.00,'克','切薄片'),(51,134,2.00,'汤匙',NULL),(51,135,1.00,'个','切丝'),(52,4,1.00,'汤匙',NULL),(52,11,3.00,'汤匙',NULL),(52,12,1.00,'汤匙',NULL),(52,16,3.00,'个',NULL),(52,20,10.00,'个','剪段'),(52,24,1.00,'茶匙',NULL),(52,32,3.00,'片',NULL),(52,71,1.00,'汤匙',NULL),(52,77,1.00,'小段',NULL),(52,81,500.00,'克',NULL),(53,4,1.00,'汤匙',NULL),(53,11,3.00,'汤匙',NULL),(53,15,2.00,'汤匙',NULL),(53,16,2.00,'个',NULL),(53,20,8.00,'个',NULL),(53,24,1.00,'茶匙',NULL),(53,32,4.00,'片',NULL),(53,75,2.00,'根','切段'),(53,77,1.00,'小段',NULL),(53,133,500.00,'克','切块'),(53,136,1.00,'个','拍裂'),(54,4,1.00,'茶匙',NULL),(54,11,3.00,'汤匙',NULL),(54,12,1.00,'汤匙',NULL),(54,16,2.00,'个',NULL),(54,20,6.00,'个',NULL),(54,24,1.00,'茶匙',NULL),(54,32,3.00,'片',NULL),(54,61,2.00,'个','去皮切块'),(54,77,1.00,'小段',NULL),(54,137,400.00,'克','切块'),(55,4,2.00,'茶匙',NULL),(55,16,3.00,'个',NULL),(55,20,10.00,'个',NULL),(55,24,2.00,'茶匙',NULL),(55,32,5.00,'片',NULL),(55,75,2.00,'根','切段'),(55,77,1.00,'小段',NULL),(55,138,600.00,'克','剁成段'),(55,139,1.00,'茶匙',NULL),(56,4,1.00,'茶匙',NULL),(56,11,2.00,'汤匙',NULL),(56,16,1.00,'个',NULL),(56,17,150.00,'毫升',NULL),(56,20,5.00,'个',NULL),(56,24,1.00,'茶匙',NULL),(56,110,1.00,'个','切块'),(56,135,1.00,'个','切丝'),(56,140,300.00,'克',NULL),(56,141,100.00,'克','切薄片'),(57,11,2.00,'汤匙',NULL),(57,71,1.00,'茶匙',NULL),(57,128,10.00,'克','切碎'),(57,142,200.00,'克',NULL),(57,143,30.00,'克',NULL),(57,144,15.00,'克',NULL),(57,145,3.00,'个','切圈'),(57,146,1.00,'个','挤汁'),(58,31,4.00,'瓣','剁成蓉'),(58,38,300.00,'克','去骨'),(58,71,1.00,'汤匙',NULL),(58,128,15.00,'克','切碎'),(58,145,5.00,'个','切碎'),(58,146,2.00,'个','挤汁'),(58,147,2.00,'汤匙',NULL),(59,20,3.00,'个','切段'),(59,31,3.00,'瓣','切片'),(59,148,300.00,'克','洗净切段'),(60,11,1.00,'汤匙',NULL),(60,14,1.00,'块','切片'),(60,15,1.00,'汤匙',NULL),(60,26,3.00,'汤匙',NULL),(60,31,3.00,'瓣','拍碎'),(60,35,250.00,'克','切薄片'),(60,145,4.00,'个','切圈'),(60,149,150.00,'克','切丝'),(61,71,2.00,'汤匙',NULL),(61,128,10.00,'克','切碎'),(61,145,2.00,'个','切细圈'),(61,150,3.00,'个','烫后去皮切块'),(62,146,1.00,'个','切片装饰'),(62,151,200.00,'克','去鳞'),(62,152,3.00,'克','粗盐'),(62,153,15.00,'毫升','去腥'),(63,6,2.00,'个','室温'),(63,99,2.00,'朵','切片'),(63,154,200.00,'毫升','自制或市售'),(63,155,30.00,'克','去虾线'),(63,156,20.00,'克','撕成丝'),(64,7,1.00,'根','切葱花'),(64,27,100.00,'克','切小丁'),(64,157,30.00,'克','推荐信州味噌'),(64,158,5.00,'克','干品泡发'),(65,6,3.00,'个','打散'),(65,92,30.00,'毫升','日式淡口'),(65,135,0.50,'个','切丝'),(65,159,200.00,'克','切块'),(65,160,20.00,'毫升',NULL),(65,161,200.00,'克','热米饭'),(66,92,15.00,'毫升','日式'),(66,162,300.00,'克','洗净'),(66,163,15.00,'克','碾碎'),(66,164,5.00,'克','细砂糖'),(67,164,1.00,'汤匙','调酸甜味'),(67,165,300.00,'克','条状或片状皆可'),(67,166,3.00,'汤匙',NULL),(67,167,1.00,'汤匙','可选，增加辣度'),(67,168,100.00,'克','切片'),(68,17,600.00,'毫升','或淘米水'),(68,27,1.00,'块','约300克，切厚片'),(68,62,100.00,'克','切薄片'),(68,75,2.00,'根','切段'),(68,166,1.00,'汤匙',NULL),(68,169,200.00,'克','切段'),(68,170,1.00,'汤匙',NULL),(69,6,1.00,'个',NULL),(69,17,50.00,'毫升','调糊用'),(69,60,3.00,'汤匙','酱汁用'),(69,71,3.00,'汤匙','酱汁用'),(69,76,2.00,'汤匙','酱汁用'),(69,92,1.00,'汤匙','酱汁用'),(69,101,300.00,'克','切条'),(69,171,100.00,'克','裹糊用'),(69,172,50.00,'克','切丝'),(69,173,50.00,'克','切丝'),(70,61,1.00,'个','切丁'),(70,62,150.00,'克','切丁'),(70,135,1.00,'个','切丁'),(70,174,300.00,'克','或手工粗面'),(70,175,4.00,'汤匙','韩式黑豆酱'),(71,6,1.00,'个','煎荷包蛋用'),(71,62,80.00,'克','切小片'),(71,123,1.00,'汤匙','装饰用'),(71,166,1.00,'汤匙','可选'),(71,169,150.00,'克','切碎'),(71,176,300.00,'克','冷饭更佳'),(71,177,1.00,'汤匙',NULL),(72,135,1.00,'个','切大块'),(72,172,2.00,'根','切滚刀块'),(72,179,500.00,'克','切块'),(72,180,300.00,'毫升','波尔多类型'),(72,181,3.00,'枝','新鲜'),(72,182,30.00,'克',NULL),(73,31,3.00,'瓣','切片'),(73,183,200.00,'克','直面或螺旋面'),(73,184,400.00,'克','整粒番茄压碎'),(73,185,30.00,'毫升','特级初榨'),(73,186,5.00,'片','手撕碎'),(73,187,30.00,'克','磨碎'),(74,24,1.00,'茶匙',NULL),(74,31,4.00,'瓣','压碎'),(74,146,2.00,'个','1个榨汁，1个切片'),(74,185,40.00,'毫升',NULL),(74,188,4.00,'只','去骨'),(74,189,2.00,'茶匙','干燥'),(74,190,0.50,'茶匙','现磨'),(75,31,1.00,'瓣',NULL),(75,173,1.00,'根','去皮切块'),(75,185,30.00,'毫升','特级初榨'),(75,191,500.00,'克','去皮切块'),(75,192,1.00,'个','去籽切块'),(75,193,20.00,'毫升','可用红酒醋替代'),(75,194,50.00,'克','隔夜面包，撕碎'),(76,31,3.00,'瓣','切碎'),(76,135,1.00,'个','切碎'),(76,182,30.00,'克',NULL),(76,195,1000.00,'克','刷洗干净，去须'),(76,196,200.00,'毫升','霞多丽或长相思'),(76,197,15.00,'克','切碎'),(77,38,300.00,'克','去骨切块'),(77,147,1.00,'汤匙',NULL),(77,198,3.00,'汤匙',NULL),(77,199,400.00,'毫升',NULL),(77,200,100.00,'克','切块'),(77,201,10.00,'片',NULL),(77,202,1.00,'茶匙','可用红糖替代'),(78,6,2.00,'个','煮熟切半'),(78,53,100.00,'克',NULL),(78,168,100.00,'克','切片'),(78,199,500.00,'毫升',NULL),(78,203,200.00,'克','泡软'),(78,204,150.00,'克','去壳留尾'),(78,205,4.00,'汤匙',NULL),(78,206,1.00,'个','切块'),(79,5,2.00,'个','切块'),(79,128,10.00,'克','切碎'),(79,147,2.00,'汤匙',NULL),(79,207,200.00,'克','去壳留尾'),(79,208,3.00,'汤匙',NULL),(79,209,100.00,'克','切块'),(79,210,1.00,'个','切圈'),(80,71,2.00,'汤匙',NULL),(80,199,200.00,'毫升',NULL),(80,211,200.00,'克','提前浸泡4小时'),(80,212,2.00,'个','成熟香甜'),(81,24,1.00,'茶匙',NULL),(81,81,500.00,'克','切块'),(81,199,400.00,'毫升',NULL),(81,202,1.00,'汤匙',NULL),(81,213,5.00,'汤匙',NULL),(81,214,2.00,'根','拍扁'),(81,215,30.00,'克','切片'),(82,21,3.00,'瓣','切片'),(82,172,50.00,'克','切片'),(82,216,200.00,'克','去皮切片'),(82,217,100.00,'克','去筋'),(82,218,50.00,'克','泡发撕小朵'),(83,4,15.00,'克',NULL),(83,14,10.00,'克','切片'),(83,18,1.00,'条','约750克，切片'),(83,20,20.00,'个','剪段'),(83,21,5.00,'瓣','拍碎'),(83,29,30.00,'克',NULL),(83,36,200.00,'克','洗净'),(84,14,10.00,'克','切末'),(84,62,500.00,'克','手工剁成肉糜'),(84,104,50.00,'克','切末'),(84,219,100.00,'克','现拆'),(84,220,200.00,'克','焯水装饰用'),(85,12,15.00,'毫升',NULL),(85,13,20.00,'克',NULL),(85,14,10.00,'克','切片'),(85,62,400.00,'克','切块'),(85,221,300.00,'克','去壳切滚刀块'),(86,14,5.00,'克','切丝'),(86,60,30.00,'毫升',NULL),(86,71,50.00,'克',NULL),(86,101,300.00,'克','切厚片'),(86,171,100.00,'克','泡水后制成糊'),(86,172,30.00,'克','切丝');
/*!40000 ALTER TABLE `recipe_ingredients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recipe_tags`
--

DROP TABLE IF EXISTS `recipe_tags`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipe_tags` (
  `recipe_id` int unsigned NOT NULL,
  `tag_id` int unsigned NOT NULL,
  PRIMARY KEY (`recipe_id`,`tag_id`),
  KEY `idx_recipe_tag` (`recipe_id`),
  KEY `idx_tag_recipe` (`tag_id`),
  CONSTRAINT `recipe_tags_ibfk_1` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE,
  CONSTRAINT `recipe_tags_ibfk_2` FOREIGN KEY (`tag_id`) REFERENCES `tags` (`id`) ON DELETE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipe_tags`
--

LOCK TABLES `recipe_tags` WRITE;
/*!40000 ALTER TABLE `recipe_tags` DISABLE KEYS */;
/*!40000 ALTER TABLE `recipe_tags` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recipes`
--

DROP TABLE IF EXISTS `recipes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipes` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(200) NOT NULL,
  `description` text,
  `cooking_time` int unsigned DEFAULT NULL COMMENT '总耗时（分钟）',
  `cuisine_id` int unsigned DEFAULT NULL,
  `season_id` int unsigned DEFAULT NULL,
  `taste_id` int unsigned DEFAULT NULL,
  `difficulty_id` int unsigned DEFAULT NULL,
  `created_by` int unsigned DEFAULT NULL COMMENT '关联 users 表，允许 NULL 表示匿名',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `season_id` (`season_id`),
  KEY `taste_id` (`taste_id`),
  KEY `difficulty_id` (`difficulty_id`),
  KEY `created_by` (`created_by`),
  KEY `idx_filter` (`cuisine_id`,`taste_id`,`season_id`),
  CONSTRAINT `recipes_ibfk_1` FOREIGN KEY (`cuisine_id`) REFERENCES `cuisine` (`id`) ON DELETE RESTRICT,
  CONSTRAINT `recipes_ibfk_2` FOREIGN KEY (`season_id`) REFERENCES `season` (`id`) ON DELETE RESTRICT,
  CONSTRAINT `recipes_ibfk_3` FOREIGN KEY (`taste_id`) REFERENCES `taste` (`id`) ON DELETE RESTRICT,
  CONSTRAINT `recipes_ibfk_4` FOREIGN KEY (`difficulty_id`) REFERENCES `difficulty` (`id`) ON DELETE RESTRICT,
  CONSTRAINT `recipes_ibfk_5` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=88 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipes`
--

LOCK TABLES `recipes` WRITE;
/*!40000 ALTER TABLE `recipes` DISABLE KEYS */;
INSERT INTO `recipes` VALUES (1,'麻婆豆腐','麻辣鲜香，经典川菜',30,1,5,1,2,NULL,'2026-04-28 14:56:47','2026-04-28 14:56:47'),(2,'番茄炒蛋','经典的家常快手菜',15,5,5,3,1,NULL,'2026-04-28 14:58:56','2026-04-28 23:03:12'),(5,'红烧排骨','经典红烧口味，色泽红亮，肉质酥烂，香气四溢，尤其适合家庭聚餐。',60,4,5,5,1,2,'2026-04-28 22:44:16','2026-04-28 22:57:58'),(6,'酸菜鱼','一道经典的川菜，以酸菜和鲜鱼为主料，酸辣鲜美，鱼肉嫩滑，汤底浓郁，开胃下饭。',40,1,5,2,2,2,'2026-04-28 22:45:25','2026-04-28 23:09:04'),(7,'麻婆豆腐','麻辣鲜香，软嫩下饭',20,1,5,1,1,1,'2026-04-05 10:28:00','2026-04-05 10:28:00'),(8,'水煮牛肉','麻辣滚烫，牛肉嫩滑',40,1,5,1,2,1,'2026-04-21 16:38:10','2026-04-21 16:38:10'),(9,'辣子鸡','干香酥脆，麻辣过瘾',45,1,5,1,2,1,'2026-04-19 21:53:45','2026-04-19 21:53:45'),(10,'水煮鱼','鲜嫩麻辣，热油激香',50,1,5,1,3,1,'2026-04-04 16:02:17','2026-04-04 16:02:17'),(11,'毛血旺','麻辣鲜烫，料足味浓',50,1,5,1,3,1,'2026-04-13 09:29:50','2026-04-13 09:29:50'),(12,'白灼基围虾','清甜弹牙，原汁原味',15,2,2,5,1,1,'2026-04-11 20:16:28','2026-04-11 20:16:28'),(13,'清蒸鲈鱼','肉质鲜嫩，清香四溢',25,2,1,5,2,1,'2026-04-02 22:14:45','2026-04-02 22:14:45'),(14,'上汤娃娃菜','清甜爽口，汤汁鲜美',20,2,2,5,1,1,'2026-04-03 17:39:34','2026-04-03 17:39:34'),(15,'干炒牛河','锅气十足，咸香弹滑',20,2,5,5,2,1,'2026-04-04 09:00:42','2026-04-04 09:00:42'),(16,'冬瓜薏米老鸭汤','清热祛湿，鲜醇滋补',120,2,2,5,2,1,'2026-04-25 20:05:50','2026-04-25 20:05:50'),(17,'剁椒鱼头','湘菜经典，鲜辣开胃',30,3,3,8,2,1,'2026-04-18 20:34:40','2026-04-18 20:34:40'),(18,'酸辣肥肠','酸辣浓郁，肥而不腻',60,3,4,2,3,1,'2026-04-23 22:01:52','2026-04-23 22:01:52'),(19,'酸辣土豆丝','脆爽酸辣，家常快手',15,3,3,2,1,1,'2026-04-15 16:12:52','2026-04-15 16:12:52'),(20,'农家小炒肉','香辣下饭，经典湘味',20,3,4,8,1,1,'2026-04-27 17:09:26','2026-04-27 17:09:26'),(21,'腊味合蒸','烟熏腊香，秋冬暖身',45,3,4,5,2,1,'2026-04-03 21:42:19','2026-04-03 21:42:19'),(22,'葱烧海参','经典鲁菜，海参软糯葱香浓郁',60,4,5,5,3,1,'2026-04-06 09:01:02','2026-04-06 09:01:02'),(23,'油焖大虾','色泽红亮，虾肉鲜嫩，咸鲜回甜',25,4,5,5,2,1,'2026-04-27 08:19:10','2026-04-27 08:19:10'),(24,'九转大肠','大肠软烂，五味俱全，经典鲁菜',120,4,5,10,3,1,'2026-04-27 19:12:31','2026-04-27 19:12:31'),(25,'糖醋鲤鱼','外酥里嫩，酸甜适口，寓意年年有余',40,4,5,5,2,1,'2026-04-02 19:10:04','2026-04-02 19:10:04'),(26,'扒牛肉条','牛肉酥烂，酱香浓郁，下饭佳肴',90,4,5,10,2,1,'2026-03-31 16:23:10','2026-03-31 16:23:10'),(27,'清炖蟹粉狮子头','肉质鲜嫩，蟹粉点缀，清淡鲜美',90,5,1,4,2,1,'2026-04-01 20:44:34','2026-04-01 20:44:34'),(28,'松鼠鳜鱼','酸甜可口，造型如松鼠，外酥里嫩',45,5,2,3,3,1,'2026-04-03 11:29:02','2026-04-03 11:29:02'),(29,'碧螺虾仁','虾仁晶莹，茶香清雅，春意盎然',20,5,1,4,2,1,'2026-04-24 12:14:04','2026-04-24 12:14:04'),(30,'樱桃肉','色泽红亮，酸甜适口，形似樱桃',60,5,2,3,2,1,'2026-04-01 18:42:09','2026-04-01 18:42:09'),(31,'清炒马兰头','清爽微甘，春季野菜，简单健康',15,5,1,4,1,1,'2026-04-19 19:18:09','2026-04-19 19:18:09'),(32,'西湖醋鱼','草鱼浇上糖醋汁，鲜嫩酸甜',30,6,1,5,2,1,'2026-03-30 14:12:40','2026-03-30 14:12:40'),(33,'龙井虾仁','虾仁晶莹，茶香清雅，鲜嫩可口',20,6,1,4,2,1,'2026-04-07 18:43:07','2026-04-07 18:43:07'),(34,'东坡肉','五花肉炖得酥烂，肥而不腻，入口即化',120,6,3,5,3,1,'2026-04-15 20:48:41','2026-04-15 20:48:41'),(35,'清汤越鸡','鸡肉清鲜，汤醇味美，滋补养身',90,6,3,5,2,1,'2026-03-30 15:22:59','2026-03-30 15:22:59'),(36,'干炸响铃','腐皮炸至金黄酥脆，形如铃铛',15,6,1,4,1,1,'2026-04-13 10:21:47','2026-04-13 10:21:47'),(37,'佛跳墙','闽菜首席，坛启荤香飘四邻',360,7,5,5,3,1,'2026-04-28 09:16:59','2026-04-28 09:16:59'),(38,'荔枝肉','形似荔枝，酸甜可口',45,7,5,3,2,1,'2026-04-20 18:14:06','2026-04-20 18:14:06'),(39,'南煎肝','嫩滑猪肝，酱香浓郁',25,7,5,5,2,1,'2026-04-19 12:39:20','2026-04-19 12:39:20'),(40,'醉排骨','酒香扑鼻，骨酥肉嫩',40,7,5,5,1,1,'2026-04-08 08:10:00','2026-04-08 08:10:00'),(41,'淡糟香螺片','糟香独特，螺片爽脆',30,7,5,5,2,1,'2026-04-09 10:30:46','2026-04-09 10:30:46'),(42,'徽州一品锅','层层堆叠的冬日暖锅',120,8,4,11,3,1,'2026-04-01 08:45:12','2026-04-01 08:45:12'),(43,'胡适一品锅','胡适家乡的经典暖锅',90,8,4,11,2,1,'2026-04-20 19:43:44','2026-04-20 19:43:44'),(44,'绩溪炒粉丝','徽州特色家常炒粉',30,8,3,11,1,1,'2026-04-24 13:20:51','2026-04-24 13:20:51'),(45,'徽州毛豆腐','发酵豆腐的独特鲜香',40,8,3,11,2,1,'2026-04-18 11:45:19','2026-04-18 11:45:19'),(46,'徽式酱排骨','浓油赤酱的秋冬硬菜',90,8,4,11,2,1,'2026-04-16 20:19:47','2026-04-16 20:19:47'),(47,'蒜香酱骨架','蒜香浓郁，酱香四溢的猪脊骨',90,9,4,9,2,1,'2026-04-18 18:25:43','2026-04-18 18:25:43'),(48,'蒜泥白肉','蒜香扑鼻的经典凉菜',40,9,4,9,1,1,'2026-04-23 19:44:47','2026-04-23 19:44:47'),(49,'蒜烧鳕鱼','蒜香浓郁，鱼肉鲜嫩下饭',30,9,4,5,2,1,'2026-03-31 14:56:08','2026-03-31 14:56:08'),(50,'蒜蓉粉丝蒸娃娃菜','蒜香浓郁，清甜爽口暖胃',25,9,4,5,1,1,'2026-04-23 11:38:02','2026-04-23 11:38:02'),(51,'蒜香孜然羊肉','蒜香孜然，暖身驱寒经典',30,9,4,5,2,1,'2026-04-21 17:21:47','2026-04-21 17:21:47'),(52,'五香辣牛肉干','西北风味五香辣牛肉干，秋冬暖身',120,10,3,10,2,1,'2026-03-31 19:37:01','2026-03-31 19:37:01'),(53,'五香辣羊肉煲','西北经典五香辣羊肉，秋冬滋补',90,10,4,10,2,1,'2026-04-15 08:57:40','2026-04-15 08:57:40'),(54,'五香辣土豆烧牛肉','西北家常五香辣土豆牛肉，暖胃',60,10,3,10,1,1,'2026-04-18 19:22:43','2026-04-18 19:22:43'),(55,'五香辣手抓羊肉','西北经典五香辣手抓羊肉，原汁原味',90,10,4,10,2,1,'2026-04-09 11:49:26','2026-04-09 11:49:26'),(56,'五香辣炒面片','西北风味五香辣炒面片，筋道暖身',45,10,3,10,2,1,'2026-04-05 09:48:23','2026-04-05 09:48:23'),(57,'酸辣凉米线','清爽开胃的云南夏日凉品',20,11,2,2,1,1,'2026-04-14 15:10:46','2026-04-14 15:10:46'),(58,'傣味柠檬鸡','酸辣鲜香，春夏清爽佳肴',35,11,1,2,2,1,'2026-04-23 10:52:20','2026-04-23 10:52:20'),(59,'清炒水性杨花','云南特色水生野菜，清淡爽口',10,11,1,4,1,1,'2026-04-16 08:02:09','2026-04-16 08:02:09'),(60,'酸笋牛肉','酸辣浓香，最具云南风情',30,11,2,2,2,1,'2026-04-16 22:19:57','2026-04-16 22:19:57'),(61,'凉拌树番茄','酸甜清爽，树番茄独特风味',15,11,2,3,1,1,'2026-04-13 16:48:57','2026-04-13 16:48:57'),(62,'日式盐烤三文鱼','外焦里嫩，咸鲜适口',25,12,5,5,1,1,'2026-04-27 14:21:54','2026-04-27 14:21:54'),(63,'茶碗蒸','嫩滑如布丁，鲜香回甘',30,12,5,5,1,1,'2026-04-18 16:21:19','2026-04-18 16:21:19'),(64,'味噌汤','温暖醇厚，日式家常汤品',20,12,5,5,1,1,'2026-04-09 22:32:17','2026-04-09 22:32:17'),(65,'日式亲子丼','鸡肉鸡蛋覆盖米饭，柔嫩多汁',20,12,5,5,1,1,'2026-04-20 15:02:49','2026-04-20 15:02:49'),(66,'日式凉拌菠菜','清爽解腻，芝麻飘香',15,12,5,5,1,1,'2026-03-30 13:46:36','2026-03-30 13:46:36'),(67,'韩式辣炒年糕','甜辣软糯，暖身经典韩式街头小吃',20,13,4,3,1,1,'2026-04-09 18:48:20','2026-04-09 18:48:20'),(68,'泡菜豆腐锅','酸辣暖胃，秋冬滋补首选韩式锅物',25,13,4,3,1,1,'2026-04-09 18:40:50','2026-04-09 18:40:50'),(69,'韩式糖醋肉','酸甜酥脆，韩式中餐馆头号招牌',40,13,3,3,2,1,'2026-04-06 11:48:03','2026-04-06 11:48:03'),(70,'韩式炸酱面','酱香微甜，韩式中华料理经典面食',35,13,3,3,2,1,'2026-04-02 22:09:19','2026-04-02 22:09:19'),(71,'泡菜炒饭','酸辣开胃，韩式剩饭完美变身',15,13,4,3,1,1,'2026-04-04 19:34:08','2026-04-04 19:34:08'),(72,'法式红酒炖牛肉','红酒慢炖牛肉，浓郁醇香',120,14,5,5,2,1,'2026-04-11 17:36:05','2026-04-11 17:36:05'),(73,'意式番茄酱汁意面','酸甜番茄酱搭配弹牙意面',30,14,5,3,1,1,'2026-04-17 13:07:47','2026-04-17 13:07:47'),(74,'希腊式柠檬鸡','清新柠檬汁烤鸡，清淡可口',60,14,5,4,2,1,'2026-04-16 12:35:16','2026-04-16 12:35:16'),(75,'西班牙番茄冷汤','冰爽酸甜的夏日经典冷汤',15,14,5,3,1,1,'2026-04-05 16:01:53','2026-04-05 16:01:53'),(76,'法式白酒煮贻贝','白酒奶油汤汁，鲜美清淡',25,14,5,4,1,1,'2026-04-12 21:21:43','2026-04-12 21:21:43'),(77,'泰式青咖喱鸡','清爽微辣的青咖喱鸡肉',30,15,2,12,2,1,'2026-04-25 21:22:32','2026-04-25 21:22:32'),(78,'新加坡叻沙','浓郁椰奶咖喱米粉汤',40,15,2,12,2,1,'2026-04-01 15:21:12','2026-04-01 15:21:12'),(79,'越南酸辣虾汤','酸甜开胃的清爽虾汤',25,15,2,3,1,1,'2026-04-14 18:52:49','2026-04-14 18:52:49'),(80,'泰式芒果糯米饭','香甜软糯的夏日甜品',35,15,2,6,1,1,'2026-04-18 08:35:53','2026-04-18 08:35:53'),(81,'印尼仁当牛肉','慢炖椰奶咖喱牛肉',120,15,2,12,3,1,'2026-04-27 21:52:45','2026-04-27 21:52:45'),(82,'荷塘月色','清新爽脆的夏日素炒',15,2,2,4,1,1,'2026-04-25 10:31:46','2026-04-25 10:31:46'),(83,'麻辣水煮鱼','麻辣鲜香，冬日暖身佳肴',40,1,4,1,2,1,'2026-04-08 17:05:01','2026-04-08 17:05:01'),(84,'蟹粉狮子头','秋日时令，鲜美醇厚',120,5,3,5,3,1,'2026-04-05 18:42:29','2026-04-05 18:42:29'),(85,'春笋烧肉','春日限定，咸鲜回甘',60,8,1,5,2,1,'2026-04-22 20:33:43','2026-04-22 20:33:43'),(86,'锅包肉','酸甜酥脆，四季皆宜的经典',30,9,5,3,2,1,'2026-03-31 14:30:15','2026-03-31 14:30:15');
/*!40000 ALTER TABLE `recipes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `season`
--

DROP TABLE IF EXISTS `season`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `season` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `season`
--

LOCK TABLES `season` WRITE;
/*!40000 ALTER TABLE `season` DISABLE KEYS */;
INSERT INTO `season` VALUES (4,'冬'),(5,'四季皆宜'),(2,'夏'),(1,'春'),(3,'秋');
/*!40000 ALTER TABLE `season` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `steps`
--

DROP TABLE IF EXISTS `steps`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `steps` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `recipe_id` int unsigned NOT NULL,
  `step_number` int unsigned NOT NULL COMMENT '步骤序号，从1开始',
  `instruction` text NOT NULL,
  `duration` int unsigned DEFAULT NULL COMMENT '该步骤预计耗时（秒）',
  PRIMARY KEY (`id`),
  KEY `idx_recipe_steps` (`recipe_id`),
  CONSTRAINT `steps_ibfk_1` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=257 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `steps`
--

LOCK TABLES `steps` WRITE;
/*!40000 ALTER TABLE `steps` DISABLE KEYS */;
INSERT INTO `steps` VALUES (1,1,1,'豆腐切块，冷水下锅加盐焯水',120),(2,1,2,'牛肉馅炸酥捞出',180),(3,1,3,'锅中放油，加入豆瓣酱炒出红油',60),(4,1,4,'加入豆腐和适量水，小火炖5分钟',300),(5,1,5,'撒花椒粉，出锅装盘',30),(33,5,1,'排骨冷水下锅，加入姜片和料酒，焯水去血沫，捞出沥干。',480),(34,5,2,'锅中放少许油，加入冰糖，小火炒至枣红色，下排骨快速翻炒上色。',300),(35,5,3,'加入生抽、老抽、葱段、八角，翻炒均匀后加入水，大火烧开转小火慢炖40分钟。',2400),(36,5,4,'开大火收汁，至汤汁浓稠包裹排骨，即可出锅装盘。',180),(37,2,1,'番茄切块，鸡蛋打散',60),(38,2,2,'锅中放油，先炒鸡蛋盛出',120),(39,2,3,'再炒番茄出汁，加入鸡蛋翻炒',180),(40,2,4,'加盐调味，撒葱花出锅',30),(41,6,1,'草鱼处理干净，片成鱼片，鱼骨切块。鱼片用鸡蛋清、淀粉、料酒、少许盐和白胡椒粉抓匀腌制15分钟。',900),(42,6,2,'酸菜切段，姜蒜切片，葱切段，干辣椒剪成小段。',180),(43,6,3,'锅中倒油烧热，下姜片、蒜片、葱段爆香，加入酸菜翻炒出香味。',180),(44,6,4,'加入鱼骨块翻炒至变色，倒入足量开水（约1500毫升），大火煮开后转中火煮10分钟至汤色发白。',600),(45,6,5,'将鱼骨和酸菜捞出铺在大碗底部，锅中留汤。汤再次烧开，下入腌好的鱼片，用筷子轻轻拨散，煮至鱼片变白（约30秒）立即关火。',60),(46,6,6,'将鱼片和汤倒入装有酸菜和鱼骨的碗中。',30),(47,6,7,'另起锅烧热油（约30毫升），放入干辣椒段和花椒炸香，迅速泼在鱼片上，撒上葱花即可。',120),(48,7,1,'豆腐切2厘米方块，开水加盐焯烫2分钟，捞出沥干',180),(49,7,2,'锅中倒油烧热，下猪肉末炒至变色，加豆瓣酱炒出红油',120),(50,7,3,'放入姜蒜末炒香，加200毫升清水烧开，滑入豆腐，小火煮5分钟',300),(51,7,4,'淋入水淀粉勾芡，撒花椒粉和葱花，翻匀出锅',60),(52,8,1,'牛肉片加蛋清、淀粉、少许盐抓匀腌制15分钟',900),(53,8,2,'锅中水烧开，下黄豆芽和莴笋叶烫熟，捞出铺碗底',180),(54,8,3,'另起锅倒油，小火炒香豆瓣酱、姜片，加水烧开，下牛肉片滑熟，连汤倒入菜碗',600),(55,8,4,'撒上蒜末、干辣椒段、花椒，淋上滚烫热油激出香味',60),(56,9,1,'鸡块加料酒、生抽、淀粉抓匀腌制20分钟',1200),(57,9,2,'锅中宽油烧至六成热，下鸡块中火炸至金黄酥脆，捞出沥油',480),(58,9,3,'锅留底油，小火炒香干辣椒、花椒、姜蒜葱，出红油',180),(59,9,4,'放入炸好的鸡块，大火快速翻炒均匀，加少许盐调味，出锅',120),(60,10,1,'鱼片加蛋清、淀粉、少许盐和料酒抓匀腌制15分钟',900),(61,10,2,'水烧开，下黄豆芽烫熟，捞出铺大碗底',180),(62,10,3,'锅中倒油，小火炒香豆瓣酱和姜片，加足量水烧开，滑入鱼片煮2分钟，连汤倒入菜碗',540),(63,10,4,'撒上蒜末、干辣椒、花椒，淋上滚烫热油，激出香味即可',60),(64,11,1,'鸭血和毛肚分别焯水30秒，捞出沥干',60),(65,11,2,'水烧开，下黄豆芽烫熟，捞出铺大碗底',180),(66,11,3,'锅倒油，小火炒香豆瓣酱、姜片，加水烧开，放入鸭血、午餐肉煮3分钟，再下毛肚烫30秒，连汤倒入菜碗',480),(67,11,4,'撒上蒜末、干辣椒、花椒，淋上滚烫热油，激出香味',60),(68,12,1,'锅中加水，放入姜片、葱段和料酒，大火煮沸',180),(69,12,2,'将基围虾倒入沸水中，煮至虾身变红弯曲，约2-3分钟',150),(70,12,3,'捞出虾，沥干水分，摆盘；小碗中混合生抽和花生油作为蘸料',60),(71,13,1,'鱼身两面各划三刀，抹少许盐，鱼腹塞入姜丝和葱段，上蒸盘',120),(72,13,2,'蒸锅水烧开后，放入鱼盘，大火蒸8-10分钟',540),(73,13,3,'取出鱼盘，倒掉盘中汤汁，铺上新鲜葱姜丝，淋上蒸鱼豉油，再浇上烧热的花生油',60),(74,15,1,'热锅冷油，大火快炒牛肉片至变色，盛出备用',120),(75,15,2,'锅中再加少许油，放入河粉，用筷子拨散，中火煎至微黄',180),(76,15,3,'加入豆芽、韭黄、葱段和牛肉，淋入生抽和老抽，快速翻炒均匀，出锅',120),(77,17,1,'鱼头洗净，从顶部劈开，抹上料酒和姜片腌制10分钟',600),(78,17,2,'将剁辣椒、蒜末均匀铺在鱼头上，淋上蒸鱼豉油',120),(79,17,3,'放入蒸锅，大火蒸15分钟至鱼眼突出',900),(80,17,4,'取出撒葱花，淋上热油激香',60),(81,18,1,'大肠用盐和醋反复搓洗，焯水后切段',900),(82,18,2,'热锅冷油，爆香姜、蒜、干辣椒',180),(83,18,3,'下大肠煸炒至金黄，加入酸菜翻炒',300),(84,18,4,'加料酒、盐和适量水，焖煮20分钟',1200),(85,18,5,'收汁后撒青蒜段，翻炒均匀出锅',120),(86,19,1,'土豆丝用清水浸泡10分钟去淀粉，沥干',600),(87,19,2,'热锅倒油，爆香干辣椒和蒜片',120),(88,19,3,'下土豆丝大火翻炒，加白醋和盐，炒至断生',180),(89,20,1,'五花肉片用料酒和生抽腌制5分钟',300),(90,20,2,'热锅少油，煸炒五花肉至出油微焦，盛出',240),(91,20,3,'用底油爆香蒜片、豆豉和青红椒圈',120),(92,20,4,'倒回肉片，加生抽快速翻炒均匀',60),(93,21,1,'将腊肉、腊肠、腊鱼用温水浸泡10分钟，稍去咸味',600),(94,21,2,'把腊味整齐码入盘中，撒上姜丝、料酒和干辣椒',60),(95,21,3,'放入蒸锅，大火蒸30分钟至腊味软熟',1800),(96,22,1,'海参洗净，切长条，焯水2分钟去腥',120),(97,22,2,'锅中放油，下葱段姜片爆香',60),(98,22,3,'加入海参翻炒，烹入料酒、生抽、老抽、白糖',90),(99,22,4,'倒入鸡汤，小火煨炖40分钟至海参软糯',2400),(100,22,5,'大火收汁，加盐调味，水淀粉勾芡，淋明油出锅',180),(101,23,1,'虾用料酒、少许盐腌制10分钟',600),(102,23,2,'锅中油热，下葱姜爆香，放入虾煎至两面变红',180),(103,23,3,'加入番茄酱、白糖、少量水，盖盖焖5分钟',300),(104,23,4,'开盖大火收汁，加盐调味，翻匀出锅',120),(105,24,1,'大肠反复搓洗，焯水去腥，切段',600),(106,24,2,'锅中加清水，放入大肠、葱姜、八角、桂皮，煮40分钟至软',2400),(107,24,3,'捞出大肠，另起油锅，下白糖炒至焦糖色',180),(108,24,4,'放入大肠翻炒上色，加料酒、生抽、老抽、醋、胡椒粉和适量水',120),(109,24,5,'小火焖30分钟，大火收汁，加盐调味，淋明油装盘',1860),(110,25,1,'鲤鱼两面切花刀，用料酒、盐腌制10分钟',600),(111,25,2,'鱼身均匀拍上淀粉，油温七成热时下鱼炸至两面金黄酥脆，捞出',480),(112,25,3,'另起锅，少许油爆香葱姜蒜，加入番茄酱、白糖、醋、生抽和少量水',120),(113,25,4,'煮至汤汁浓稠，浇在炸好的鱼上即可',120),(114,26,1,'牛肉整块冷水下锅，焯水去血沫，捞出洗净',600),(115,26,2,'锅中加水，放入牛肉、葱姜、八角、桂皮、料酒，大火烧开转小火煮60分钟至牛肉酥烂',3600),(116,26,3,'捞出牛肉，稍凉后切成厚片，码入盘中',300),(117,26,4,'煮肉原汤过滤，加生抽、老抽、白糖、盐调成汁，浇在牛肉上',60),(118,26,5,'放入蒸锅大火蒸10分钟，取出后汤汁滗入锅中，水淀粉勾芡，淋在牛肉上',720),(119,27,1,'将猪五花肉切成细丁，加入蟹粉、姜末、葱末、料酒、盐、白胡椒粉拌匀，制成肉丸',600),(120,27,2,'砂锅中放入清水烧开，轻轻放入肉丸，表面盖上白菜叶，转小火慢炖',4800),(121,27,3,'炖至肉质酥烂，汤汁清澈，撇去浮油，取出白菜叶，调入少许盐即可',120),(122,28,1,'鳜鱼去鳞去内脏，从鱼头下方切下，保留鱼头，沿脊骨两侧片开，切花刀，用料酒、盐腌制10分钟',600),(123,28,2,'将鱼身均匀裹上淀粉，提起鱼尾使花纹散开，入七成热油锅炸至金黄酥脆，鱼头也炸熟',480),(124,28,3,'锅中留底油，炒香葱姜丝，加入番茄酱、白糖、香醋和少量水，勾芡后浇在炸好的鱼上即可',300),(125,29,1,'河虾仁用盐轻轻搓洗，清水冲净，沥干后用蛋清、淀粉、料酒上浆腌制10分钟',600),(126,29,2,'碧螺春用80℃热水冲泡，取茶汤约50毫升，茶叶沥干备用',120),(127,29,3,'热锅凉油，滑炒虾仁至变色，加入茶汤和茶叶快速翻炒，调入盐，勾薄芡出锅',180),(128,30,1,'五花肉切2厘米见方的小块，冷水下锅焯水去血沫，捞出沥干',300),(129,30,2,'锅中放油，炒香姜葱，加入肉块翻炒，加料酒、番茄酱、红曲米水、白糖和没过肉的开水，大火烧开转小火焖40分钟',2400),(130,30,3,'待肉酥烂，大火收汁，汤汁浓稠包裹肉块，加盐调味，出锅装盘',300),(131,31,1,'马兰头洗净，入沸水焯烫30秒，捞出过凉水，挤干切碎',60),(132,31,2,'香干切小丁，松子仁小火炒香备用',120),(133,31,3,'锅中放油，下香干丁略炒，加入马兰头、盐、白糖快速翻炒均匀，撒松子仁出锅',120),(134,32,1,'草鱼处理干净，从腹部剖开，背部不切断，摊平成扇形',120),(135,32,2,'锅中加水烧开，放入鱼、姜末和料酒，中火煮5分钟至鱼熟',300),(136,32,3,'捞出鱼装盘，锅中留少许水，加入醋、白糖、酱油烧开，用水淀粉勾芡，浇在鱼上即可',180),(137,33,1,'虾仁用盐、料酒、蛋清和淀粉抓匀，腌制10分钟',600),(138,33,2,'龙井茶叶用80度温水泡开，沥去茶水，留茶叶备用',120),(139,33,3,'热锅凉油，下虾仁滑炒至变色，加入茶叶翻炒均匀，出锅即可',120),(140,34,1,'五花肉冷水下锅焯水，煮沸后撇去浮沫，捞出洗净',600),(141,34,2,'砂锅底部铺上姜片和葱段，放入五花肉块，加入黄酒、酱油、冰糖和没过肉的水',120),(142,34,3,'大火烧开后转小火慢炖90分钟，至肉酥烂，收汁即可',5400),(143,35,1,'母鸡放入锅中加冷水，煮沸后撇去浮沫，捞出洗净',600),(144,35,2,'将鸡放入汤锅，加入火腿、冬笋、香菇、姜片、料酒和足量清水',120),(145,35,3,'大火烧开后转小火炖80分钟，加盐调味即可',4800),(146,36,1,'猪肉末加盐、料酒和鸡蛋液拌匀成馅',120),(147,36,2,'豆腐皮铺平，涂上薄薄一层肉馅，卷成手指粗细的圆柱，切成5厘米段',180),(148,36,3,'油锅烧至七成热，下腐皮卷炸至金黄色酥脆，捞出沥油即可',180),(149,42,1,'五花肉和土鸡分别焯水，去除血沫',600),(150,42,2,'砂锅底部铺姜片、葱结，放入五花肉、土鸡块、干笋',120),(151,42,3,'加入老抽、生抽、冰糖和没过食材的清水，大火烧开转小火慢炖1.5小时',5400),(152,42,4,'放入鹌鹑蛋，继续炖15分钟，收汁即可',900),(153,43,1,'五花肉片入锅煸炒至出油，加入酱油、黄酒、白糖翻炒上色',480),(154,43,2,'锅中加入冬笋片、香菇、油豆腐，倒入适量清水没过食材',120),(155,43,3,'大火烧开转小火炖40分钟，最后放入粉丝煮3分钟即可',2400),(156,44,1,'猪油下锅融化，爆香肉丝和香菇丝',180),(157,44,2,'加入泡软的粉丝，大火快速翻炒，加入生抽、老抽调味',300),(158,44,3,'放入小青菜段翻炒至断生，出锅即可',120),(159,45,1,'平底锅倒油烧热，放入毛豆腐片煎至两面金黄焦脆',480),(160,45,2,'另起锅爆香蒜末，加入辣椒酱和酱油炒香',120),(161,45,3,'将酱汁淋在煎好的毛豆腐上，撒葱花即可',60),(162,46,1,'排骨冷水下锅焯水，捞出沥干',600),(163,46,2,'锅中放少许油，加入冰糖小火炒出糖色，放入排骨翻炒上色',360),(164,46,3,'加入生抽、老抽、黄酒、姜片、八角、桂皮和没过排骨的热水，大火烧开转小火炖1小时，收汁即可',3600),(165,50,1,'将娃娃菜铺在盘中，泡软的粉丝放在娃娃菜上',120),(166,50,2,'热锅放油，小火炒香蒜蓉至微黄，加入生抽和蚝油调成蒜蓉酱',180),(167,50,3,'将蒜蓉酱均匀浇在粉丝和娃娃菜上',30),(168,50,4,'放入蒸锅，大火蒸10分钟，出锅后撒上红椒圈即可',600),(169,52,1,'牛腱子肉切大块，冷水下锅焯水去血沫，捞出洗净',600),(170,52,2,'锅中加水没过牛肉，放入干辣椒、花椒、八角、桂皮、生姜、生抽、老抽、白糖、盐，大火烧开转小火炖1小时至牛肉熟透',3600),(171,52,3,'取出牛肉晾凉，顺纹切成长条，放入烤盘，150度烤40分钟至表面干爽，期间翻动一次',2400),(172,53,1,'羊肉块冷水下锅，加料酒焯水去膻，捞出沥干',600),(173,53,2,'热锅少油，爆香干辣椒、花椒、八角、桂皮、草果、姜片、葱段，放入羊肉翻炒至表面微黄',300),(174,53,3,'加入生抽、盐和足量开水，大火烧开转小火炖1小时至羊肉酥烂，收汁即可',3600),(175,54,1,'牛腩焯水去血沫，捞出洗净备用',480),(176,54,2,'热油爆香干辣椒、花椒、八角、桂皮、姜片，放入牛腩翻炒，加生抽、老抽上色',300),(177,54,3,'加入足量水大火烧开转小火炖40分钟，放入土豆块和盐，继续炖15分钟至土豆软烂',3300),(178,55,1,'羊排冷水浸泡1小时去血水，中途换水',3600),(179,55,2,'锅中加足量水，放入羊排、干辣椒、花椒、八角、桂皮、小茴香、姜片、葱段、盐，大火烧开撇去浮沫',600),(180,55,3,'转小火炖1小时至羊肉脱骨，捞出装盘，可蘸椒盐食用',3600),(181,56,1,'面粉加水和成光滑面团，醒面20分钟，擀成厚片，切成小面片',1500),(182,56,2,'面片下沸水煮至浮起，捞出过凉水沥干',300),(183,56,3,'热油爆香干辣椒、花椒、八角，加入羊肉片翻炒变色，放入洋葱、青椒炒香，加入面片、生抽、盐翻炒均匀即可',600),(184,57,1,'干米线用温水泡软后，入沸水煮至无硬心，捞出过凉水沥干',600),(185,57,2,'将酸腌菜、花生碎、香菜、小米辣、柠檬汁、生抽、白糖混合成酱汁',180),(186,57,3,'将酱汁浇在米线上，拌匀即可食用',60),(187,60,1,'牛肉片用生抽、料酒腌制10分钟',600),(188,60,2,'热油爆香姜片、蒜、小米辣，加入酸笋翻炒出香味',120),(189,60,3,'放入牛肉片大火快速翻炒至变色，即可出锅',120),(190,62,1,'三文鱼洗净，用厨房纸吸干水分，均匀涂抹海盐和清酒，腌制10分钟',600),(191,62,2,'烤箱预热至200°C，烤盘铺锡纸，放入三文鱼',300),(192,62,3,'烤制15分钟至表面金黄，取出挤柠檬汁即可',900),(193,63,1,'鸡蛋打散，加入柴鱼高汤搅匀，过滤蛋液',180),(194,63,2,'将虾仁、蟹肉棒、香菇放入蒸碗，倒入蛋液',60),(195,63,3,'蒸锅水开后放入，中小火蒸15分钟至凝固',900),(196,64,1,'锅中加400毫升水，放入海带芽煮至沸腾',300),(197,64,2,'转小火，加入豆腐丁煮2分钟',120),(198,64,3,'关火，用漏勺将味噌化入汤中，撒葱花即可',60),(199,65,1,'小锅中加酱油、味醂和100毫升水，煮开后放入洋葱丝和鸡肉，中火煮5分钟',300),(200,65,2,'将蛋液均匀倒入锅中，盖盖小火煮至蛋半凝固',120),(201,65,3,'将煮好的鸡肉蛋浇在米饭上，撒少许海苔碎',30),(202,66,1,'烧一锅水，菠菜焯水30秒，捞出过冰水，挤干切段',60),(203,66,2,'碗中混合芝麻、酱油和糖，调成酱汁',30),(204,66,3,'将酱汁与菠菜拌匀，装盘即可',30),(205,72,1,'牛肉块用红酒、百里香腌制冷藏2小时',7200),(206,72,2,'锅中融化黄油，大火煎牛肉至表面焦黄',600),(207,72,3,'加入洋葱、胡萝卜翻炒，倒入腌汁和适量水，小火炖煮1.5小时至牛肉酥烂',5400),(208,73,1,'大锅烧水加盐，煮意面至弹牙状态，捞出留面汤',480),(209,73,2,'另起锅橄榄油炒香蒜片，加入番茄罐头中火煮15分钟至浓稠',900),(210,73,3,'将意面拌入酱汁，加少许面汤调整浓度，撒罗勒和帕玛森奶酪',120),(211,74,1,'将柠檬汁、橄榄油、蒜末、牛至、盐和黑胡椒混合成腌料',120),(212,74,2,'鸡腿划几刀，放入腌料中按摩，冷藏腌制30分钟',1800),(213,74,3,'烤箱预热200℃，鸡腿皮朝上放烤盘，铺柠檬片，烤25-30分钟至金黄',1500),(214,75,1,'将所有食材放入搅拌机，搅打成细腻浓汤',120),(215,75,2,'根据浓度加冰水调节，用盐和黑胡椒调味',60),(216,75,3,'冷藏至少1小时，饮用前可点缀番茄丁和橄榄油',3600),(217,76,1,'大锅中火融化黄油，炒香洋葱碎和蒜碎至透明',180),(218,76,2,'倒入白葡萄酒，放入贻贝，盖盖大火煮3-4分钟至贻贝开口',240),(219,76,3,'撒入欧芹碎，翻拌均匀，立即连汤汁盛入深盘',30),(220,77,1,'中火加热锅，倒入一半椰奶煮至冒泡，加入青咖喱酱炒香',180),(221,77,2,'放入鸡腿肉翻炒至变色，倒入剩余椰奶煮沸',300),(222,77,3,'加入茄子、鱼露和椰糖，小火煮10分钟至鸡肉熟透',600),(223,77,4,'关火前撒入罗勒叶，翻拌均匀即可出锅',30),(224,78,1,'锅中加少许油，炒香叻沙酱至出红油',120),(225,78,2,'倒入椰奶和适量水（约200毫升），煮开后放入虾和鱼饼，煮5分钟',300),(226,78,3,'另起锅煮开水，将米粉焯烫30秒捞出放入碗中',60),(227,78,4,'将叻沙汤浇在米粉上，摆上豆芽、鸡蛋和青柠即可',30),(228,79,1,'锅中加水500毫升煮开，放入番茄和菠萝煮5分钟',300),(229,79,2,'加入大虾和辣椒，煮至虾变红',180),(230,79,3,'调入鱼露和青柠汁，搅匀后关火',30),(231,79,4,'撒上香菜碎即可盛出食用',10),(232,81,1,'中火炒香仁当咖喱酱、香茅和南姜，约2分钟',120),(233,81,2,'加入牛肉块翻炒至表面变色',300),(234,81,3,'倒入椰奶和椰糖，煮沸后转小火，加盖慢炖1.5小时，期间偶尔搅拌',5400),(235,81,4,'开盖后大火收汁至浓稠，加盐调味即可',300),(236,82,1,'莲藕、荷兰豆、木耳、胡萝卜分别焯水30秒，捞出沥干',60),(237,82,2,'热锅冷油，爆香蒜片',30),(238,82,3,'加入所有食材大火快炒，加盐调味，翻炒均匀出锅',90),(239,83,1,'鱼片用盐、料酒、淀粉腌制15分钟',900),(240,83,2,'炒锅放油，爆香姜蒜，加入豆瓣酱炒出红油，加水烧开',300),(241,83,3,'放入豆芽煮2分钟，捞出垫碗底；鱼片下锅煮至变白，连汤倒入碗中',180),(242,83,4,'另起锅热油，炸香干辣椒和花椒，泼在鱼片上即可',120),(243,84,1,'将猪肉糜、蟹粉、荸荠末、姜末混合，加盐、料酒搅打上劲',600),(244,84,2,'将肉馅分成4份，团成大圆球，表面抹少许蟹粉',120),(245,84,3,'砂锅加水烧开，放入狮子头，转小火慢炖90分钟，加盐调味，配小油菜上桌',5400),(246,85,1,'五花肉冷水下锅，焯水去血沫，捞出洗净',300),(247,85,2,'锅中放少许油，加入冰糖炒出糖色，下五花肉翻炒上色',180),(248,85,3,'加入姜片、老抽、没过肉的开水，大火烧开转小火炖30分钟',1800),(249,85,4,'加入春笋，继续炖20分钟，大火收汁即可',1200),(250,86,1,'里脊肉片用盐、料酒腌制10分钟，裹上淀粉糊',600),(251,86,2,'油温七成热，将肉片逐片炸至金黄酥脆，捞出控油',300),(252,86,3,'锅中留底油，炒香姜丝、胡萝卜丝，倒入糖醋汁（糖+醋+少许酱油）煮浓，下肉片快速翻匀出锅',180);
/*!40000 ALTER TABLE `steps` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tags`
--

DROP TABLE IF EXISTS `tags`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tags` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tags`
--

LOCK TABLES `tags` WRITE;
/*!40000 ALTER TABLE `tags` DISABLE KEYS */;
/*!40000 ALTER TABLE `tags` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `taste`
--

DROP TABLE IF EXISTS `taste`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `taste` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `taste`
--

LOCK TABLES `taste` WRITE;
/*!40000 ALTER TABLE `taste` DISABLE KEYS */;
INSERT INTO `taste` VALUES (10,'五香'),(13,'其他'),(12,'咖喱'),(5,'咸鲜'),(4,'清淡'),(6,'甜'),(7,'苦'),(9,'蒜香'),(11,'酱香'),(3,'酸甜'),(2,'酸辣'),(8,'香辣'),(1,'麻辣');
/*!40000 ALTER TABLE `taste` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'testuser','8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92','2026-04-28 15:24:46'),(2,'snow','05d2b718275bcb361520228b9b031ca5f45f233774166ea0bca2d1bf5b9110f0','2026-04-28 20:45:45');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-04-29 12:57:34
